import React from 'react'

export interface MoonBlossomProps {
  [key: string]: any
}

export function MoonBlossom(props: MoonBlossomProps) {
  const {} = props
  const items = [
    '特定情况下，草触及水时，会生成草原核，并为队伍提供「草露」，可被特定角色消耗',
    '草原核伤害不算月绽放，月绽放伤害只包括直伤 ',
    '—— 月绽放伤害',
    '直伤月绽放无视防御，不受益于常规增伤/减伤，但受益于元素精通',
    `直伤基础 = 属性 * 倍率 * ( 1 + 基础提升% ) * (1 + (6* 元素精通/ (元素精通 + 2000)) + 月绽放增伤% )`,
    `最终直伤 = (直伤基础 + 额外提升) * 抗性系数 * 暴击区 * 擢升 `,
    '基础提升：菈乌玛天赋 14%',
    '额外提升：菈乌玛元素爆发（不受益于精通增伤、反应增伤）',
    '—— 草原核伤害',
    '草原核伤害仍为绽放/烈绽放/超绽放伤害，反应倍率为：绽放 2 | 烈绽放 超绽放 3',
    '草原核基础 = 1445.85 * 反应倍率 * ( 1+ 16* 元素精通 / (元素精通 + 2000) + 反应增伤%)',
    '草原核伤害 = (草原核基础 + 额外提升) * 抗性系数',
  ]
  return (
    <div>
      <h2>月绽放</h2>
      {items.map((_) => (
        <p key={_}>{_}</p>
      ))}
    </div>
  )
}
